verification/runs/T-family/T5_runs/T5_CUBE_c/system/epoxy/fvSchemes
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location "system/epoxy";
    object fvSchemes;
}

ddtSchemes { default steadyState; }
gradSchemes { default Gauss linear; }
divSchemes { default none; }
laplacianSchemes
{
    default Gauss linear corrected;
    laplacian(alpha,e) Gauss harmonic corrected;
    laplacian(alpha,h) Gauss harmonic corrected;
}
interpolationSchemes { default linear; }
snGradSchemes { default corrected; }
