verification/runs/T-family/T5_runs/T5_CUBE_c/system/decomposeParDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location "system";
    object decomposeParDict;
}

numberOfSubdomains 4;
method scotch;
